"[{\"title\":\"BPD and menstrual cycle\",\"selftext\":\"Hi I\\u00e2\\u20ac\\u2122m 33 and have been diagnosed for 2 years. I struggle daily. But the worst is coming up to my period (sorry men) \\nAny women on here also find that their cycle sends their emotions off into the stratosphere? I have been acting disgustingly toward my partner, I feel as though there\\u00e2\\u20ac\\u2122s no way I can even apologise and this happens each cycle. If you do find this happens to you, have you found anything which may help?\",\"created_utc\":\"1665162885\",\"over_18\":\"FALSE\",\"subreddit\":\"BPD\"},{\"title\":\"It's getting too much\",\"selftext\":\"I just want to give into my impulses and finally let go of all self control. I just want to bash my head against a wall constantly and hurt myself. Getting help is so difficult and nothing works and I just want all the pain to end. Everything is so overwhelming and controlling my symptoms is exhausting and everyone turning on me for fake reasons. Everything sucks\",\"created_utc\":\"1658755762\",\"over_18\":\"FALSE\",\"subreddit\":\"BPD\"},{\"title\":\"is anyone else EXTREMELY fixated on past relationships?\",\"selftext\":\"not sure if this is the right flair \\n\\nall past relationships. this ranges from friendships out of convenience to long term partners. there is not a day that goes by that i don\\u00e2\\u20ac\\u2122t think of every single person that i have ever had a personal relationship with.\\n\\ni\\u00e2\\u20ac\\u2122ve had countless failed friendships and 3 relationships. from the day i lose any sort of bond i had with these people they haven\\u00e2\\u20ac\\u2122t left my mind. i\\u00e2\\u20ac\\u2122m consumed by thoughts of people i haven\\u00e2\\u20ac\\u2122t spoken to in years. and some of them make my blood boil as well - people i used to be so close with that i now hate and i\\u00e2\\u20ac\\u2122m constantly so full of rage about how i got treated even though rationally i KNOW i\\u00e2\\u20ac\\u2122m the problem because why would so many of my relationships end in this way if i wasn\\u00e2\\u20ac\\u2122t \\n\\nwhen people say they don\\u00e2\\u20ac\\u2122t care about people they used to have in their life i just don\\u00e2\\u20ac\\u2122t understand because i do. and i do every day and i don\\u00e2\\u20ac\\u2122t think i ever won\\u00e2\\u20ac\\u2122t \\n\\nand the thing is, i either suddenly decided i hate them or they realised that i\\u00e2\\u20ac\\u2122m too much to keep in their lives. i was a terrible friend. i\\u00e2\\u20ac\\u2122ve been trying to get better in the past few months since i\\u00e2\\u20ac\\u2122ve realised this but now i\\u00e2\\u20ac\\u2122ve come to the realisation that i just don\\u00e2\\u20ac\\u2122t care about other people the way i think i should. sure i\\u00e2\\u20ac\\u2122ll have a fp who i obsess over and \\u00e2\\u20ac\\u0153love\\u00e2\\u20ac\\u009d but truthfully i don\\u00e2\\u20ac\\u2122t think im actually capable of genuine love. i make so few emotional connections and when the ones i do make leave me all i can do is fixate on why they left\\n\\ni don\\u00e2\\u20ac\\u2122t know if other people feel the same, but im starting to feel like a stuck record\",\"created_utc\":\"1633389520\",\"over_18\":\"FALSE\",\"subreddit\":\"BPD\"},{\"title\":\"Is there going to be a time where I don't miss my mum?\",\"selftext\":\"I miss her so much, she is alive  she and the family cut me off 3 years ago because of my emotional outbursts. I just want a hug, it's just me now and the last time she spoke to me she said it was my fault for choosing to isolate myself when I should try and stay positive and that I choose to live my life this way. I don't want to live like this, everyday I feel more like i'm lost and I don't know how to get home. SOrry that's the only way I can descrribe it. I was an herion and crack addict in my teens so I am actually struggling not to go back there again I just want these feelings to stop now. Will I always miss her like this, it's just been getting worse, I have been having nightmares everynight for the last few years and she is always there, I am going over and over again everything that hurts me deeply. Sorry I am allover the place rn and I just needed to talk to someone sorry\",\"created_utc\":\"1628457836\",\"over_18\":\"FALSE\",\"subreddit\":\"BPD\"},{\"title\":\"My fp has been acting different and it is killing me\",\"selftext\":\"This is my longest boyfriend I have ever had, it\\u00e2\\u20ac\\u2122s been a year and a couple months. I\\u00e2\\u20ac\\u2122m 20 and he\\u00e2\\u20ac\\u2122s almost 20\\u00e2\\u20ac\\u00a6 and I dont really know what is up with him. We never have fun anymore, he barely talks to me when we hang out and it is always unenthusiastic; but when I hear him talk to anyone he sounds happy and stuff. I try to talk to him about it and he says I\\u00e2\\u20ac\\u2122m creating petty drama and hes always tired because of work and that he is growing up. Im not really sure what to do, i\\u00e2\\u20ac\\u2122ve been crying my eyes out for days. I do not wanna leave because I feel like maybe he might change, he has never acted like this before he was always so in love with me and so nice to me; he would never want to make me cry or hurt my feelings and all the sudden he\\u00e2\\u20ac\\u2122s an asshole who never talks to me. I dont think hes cheating he doesnt even  really have time to do that. I wish he would just tell me what he\\u00e2\\u20ac\\u2122s thinking, I want to know if I should hang on. My boyfriend mentioned months ago that his uncle tells him hes childish and needs to grow up, he sees his uncle 5 out of 7 says out of week. I never met his uncle, but I feel like he got  in his head cause he is always using the excuse now that he is growing up. I really dont want to lose him, he was also my bestfriend who I felt so comfortable with, I have never been able to feel that way with anyone my whole life. I dont really want advice because I know its going to be negative, I just cant leave him I want to see if he will change. Sorry for the vent, I just need to let out my thoughts.\",\"created_utc\":\"1653795139\",\"over_18\":\"FALSE\",\"subreddit\":\"BPD\"},{\"title\":\"Does anyone else dread going to work????\",\"selftext\":\"I work in the food industry so i have to talk to people ALL DAY. I dread going to work and when i get there i dread the phone ringing or even a customer coming in. I can manage when i have other people working in the store with me but when i\\u00e2\\u20ac\\u2122m alone MY EMOTIONS ARE HELL! I\\u00e2\\u20ac\\u2122m scared of people i don\\u00e2\\u20ac\\u2122t trust them and every time i have to speak to them i get so scared that they are gonna scream at me or throw something at me (yes that has happened to me before)\\n\\n\\nI have tried finding other jobs but I get paid $15.50 an hour + tips (so around $19 an hour) and even jobs that require a college degree pay less than that\\u00e2\\u20ac\\u00a6. I don\\u00e2\\u20ac\\u2122t want to quit my job for an office job if it\\u00e2\\u20ac\\u2122s gonna pay me less AND require me a college degree. \\n\\nI\\u00e2\\u20ac\\u2122m seriously ready to just say fuck it and go into debt and blow throw my savings because every day i\\u00e2\\u20ac\\u2122m so close to having a mental breakdown.\",\"created_utc\":\"1627248767\",\"over_18\":\"FALSE\",\"subreddit\":\"BPD\"},{\"title\":\"help\",\"selftext\":\"[removed]\",\"created_utc\":\"1638123198\",\"over_18\":\"FALSE\",\"subreddit\":\"BPD\"},{\"title\":\"Fixated on social group of shared house I've just moved into\",\"selftext\":\"Cognitively I want to be alone but feel so connected to this social group and my impression, moved in, next to \\\"with\\\" a couple of months ago,incessant thoughts, my actions feel so out of my control, pretty lost, I know their not 'bad\\\" people, but reacted fairly strongly to judgement I felt was unfair and feeling constantly perceived, descended to the point of a fairly hostile atmosphere I have been a bit erratic, quite bad adhd, really want drop this fixation and get on with my life but can't let it go, I'm at at the point where I'm being \\\"hostile\\\" to everyone I meet, not sure where to go (m)\",\"created_utc\":\"1648860580\",\"over_18\":\"FALSE\",\"subreddit\":\"BPD\"},{\"title\":\"It\\u00e2\\u20ac\\u2122s been a while\",\"selftext\":\"I\\u00e2\\u20ac\\u2122ve not posted on here for a while now but I am in desperate need to just blurt out..\\n\\nI\\u00e2\\u20ac\\u2122m feeling so bloody depressed, worst I\\u00e2\\u20ac\\u2122ve felt in a while. I have no job, no money, my boyfriend is the current \\u00e2\\u20ac\\u02dcbread winner\\u00e2\\u20ac\\u2122 with increasing resentment towards me. I am miserable. I feel isolated. I have no friends. I have no family (they\\u00e2\\u20ac\\u2122re not dead - just abusive) and all I can think about is dying. The intrusive thoughts seem to be intensifying like someone\\u00e2\\u20ac\\u2122s turning the volume up too loud, just \\u00e2\\u20ac\\u02dcI want to die\\u00e2\\u20ac\\u2122 over and over again and no matter what else I do, think about, talk about, it\\u00e2\\u20ac\\u2122s a constant I can hear in the background.  \\nI don\\u00e2\\u20ac\\u2122t think I do want to die though? I just want relief from the non-stop-ness of being an adult. I want to hibernate for 6 months but instead of sleeping I want to do nothing and not feel guilty about it. I dunno. This is a complete ramble I am aware but I\\u00e2\\u20ac\\u2122m just feeling all over the place. Fed up. Angry. Sad. Frustrated. Lonely. I just want my Dad so badly, I miss having him in my life but he is the most awful person in the world. It\\u00e2\\u20ac\\u2122s so fucked up how someone can be so awful to you but they can still have such a hold over your life. AHHHHHH stressed stressed. \\n\\nP.s I am okay! Just needed somewhere to vent my thoughts and know it\\u00e2\\u20ac\\u2122s been seen idk\",\"created_utc\":\"1650584813\",\"over_18\":\"TRUE\",\"subreddit\":\"BPD\"},{\"title\":\"Getting emotional whiplash in my relationship\",\"selftext\":\"[deleted]\",\"created_utc\":\"1612449750\",\"over_18\":\"FALSE\",\"subreddit\":\"BPD\"},{\"title\":\"An interesting title\",\"selftext\":\"I want to die. There seems to be no end to this cyclical emptiness and I\\u00e2\\u20ac\\u2122m over it\",\"created_utc\":\"1610844428\",\"over_18\":\"FALSE\",\"subreddit\":\"BPD\"},{\"title\":\"Do you find that you get super-super into something for a period of time, and then just ghost it?\",\"selftext\":\"I've noticed in my discussions about splitting specifically that, for me, it doesn't just apply to people, but also applies to endeavors, places, and other somewhat-intangible things.\\n\\nInitially, I'm super into it. If it involves tools\\/equipment\\/supplies, I will buy everything. I will be thoroughly convinced that, finally, I have figured out what I'm supposed to do with my life, and it's also all *finally* going to work out. I then over-participate-- this can be over-commenting in a subreddit, playing too many hours of a game, bingeing a ridiculous amount of a show, working waaaay too many hours, writing for 14 hours straight, answering questions on Quora for 9 hours, and so on.\\n\\nAt some point, *usually* at a roadblock or when something disappointing happens, it's over. In the past, I would suddenly *absolutely hate* the thing and think getting involved with it was the worst decision I ever made. In more recent years, the thing just \\\"disappears\\\". Like, I will wake up one morning, months later, and be like, \\\"Oh shit, what the hell happened to that thing I was doing?\\\"\\n\\nWay back when, if enough time had past (and a lot of time has to pass-- like a year or so), I can return to the thing, and often, I don't understand at all why I thought it was a bad idea, or why it didn't work out.\",\"created_utc\":\"1621878861\",\"over_18\":\"FALSE\",\"subreddit\":\"BPD\"},{\"title\":\"always losing self identity in relationships\",\"selftext\":\"Anyone else have bad identity crises every time they get into relationships? \\n\\nSince being diagnosed two years ago, I thought I overcame my BPD, even going so far as believing that perhaps it was a misdiagnosis. Maybe I\\u00e2\\u20ac\\u2122m just an anxious and sensitive person? I\\u00e2\\u20ac\\u2122ve even gone so far as wondering if i\\u00e2\\u20ac\\u2122m fact, what I really have is a really bad case of ADHD. But it\\u00e2\\u20ac\\u2122s awful moments of realisation like this, is when I truly realise. Yeh. I have BPD. Fuck. \\n\\nI always have struggled with my sense of identity, but it\\u00e2\\u20ac\\u2122s particularly when I\\u00e2\\u20ac\\u2122m in relationships that I really feel lost. I always feel like I\\u00e2\\u20ac\\u2122m not who I really am, or want to be. I\\u00e2\\u20ac\\u2122m not ME. I always feel like relationships changes me in a way where it just terrifies me, because I don\\u00e2\\u20ac\\u2122t recognise myself anymore; I don\\u00e2\\u20ac\\u2122t like how my habits and mannerisms change. It even affects what I like and don\\u00e2\\u20ac\\u2122t like, down to really small things such as what clothes I wear, and how I do my make up. This is an awful cycle and I don\\u00e2\\u20ac\\u2122t know how to escape it. \\n\\nI met this amazing man a few months ago. I really love and care about him; he makes me so happy. This is probably the healthiest relationship I\\u00e2\\u20ac\\u2122ve ever been in, and I really feel as though he is special. But the bad thoughts have crept in again, like they always do. I feel terrified that I\\u00e2\\u20ac\\u2122m not the same person I was when I met him. I\\u00e2\\u20ac\\u2122ve changed how I look, I don\\u00e2\\u20ac\\u2122t do the hobbies I used to have and I don\\u00e2\\u20ac\\u2122t have the same energy like I used to. Fair enough to the last point though, because this pandemic has probably changed everyone\\u00e2\\u20ac\\u2122s mental energy. But still. I feel it and it\\u00e2\\u20ac\\u2122s on my mind. \\n\\nWhy do I always do this? Why can\\u00e2\\u20ac\\u2122t I just fucking accept something that is actually good in my life, and just let go of this bullshit response to getting close to someone? Like honestly, what am I even scared of? He loved me how I was then and how I am now. Why can\\u00e2\\u20ac\\u2122t this be enough? \\n\\nIsn\\u00e2\\u20ac\\u2122t that the sad truth though, that love just sometimes isn\\u00e2\\u20ac\\u2122t enough, when talking about mental health. \\n\\nSo here I am. Terrified that I\\u00e2\\u20ac\\u2122ll somehow sabotage my relationship by trying to regain my identity through chaotic and impulsive actions. I just know it\\u00e2\\u20ac\\u2122ll happen. \\n\\nI want to change and just you know, chill out? I internalise so much of my BPD (didn\\u00e2\\u20ac\\u2122t used to lol) that I just feel really alone with how I feel. I mean, how can I even explain it to him? \\u00e2\\u20ac\\u0153Hi I know everything is going really good but because I have a fucking problem, I can\\u00e2\\u20ac\\u2122t help but create a crisis for myself. I\\u00e2\\u20ac\\u2122m going to just go, move away to another city and disappear for a few months, just so I can find myself again. Even though logically people change all the time and how I feel as though I\\u00e2\\u20ac\\u2122ve changed isn\\u00e2\\u20ac\\u2122t really that significant in the grand scheme of things. Doesn\\u00e2\\u20ac\\u2122t matter that that will end up damaging my mental health further but I lack the coping mechanisms to deal with my shit. I\\u00e2\\u20ac\\u2122m sorry please don\\u00e2\\u20ac\\u2122t hate me.\\u00e2\\u20ac\\u009d\\n\\nI know this all just sounds so pointless and such a non problem. Me 2 years ago was classic BPD whereby I couldn\\u00e2\\u20ac\\u2122t help but externalise all of my problems and thoughts (it\\u00e2\\u20ac\\u2122s taken me a lot of therapy books to get me to where I am today). \\n\\nI just want to get this off my chest more than anything.\\n\\nOh and just to say, I am going try my fucking best to fight how I feel. And hell, maybe I\\u00e2\\u20ac\\u2122ll try and approach the topic to him. I just don\\u00e2\\u20ac\\u2122t want him to think it\\u00e2\\u20ac\\u2122s him, or that the relationship isn\\u00e2\\u20ac\\u2122t working because I\\u00e2\\u20ac\\u2122m too damaged.\\n\\nI don\\u00e2\\u20ac\\u2122t want to lose him because I\\u00e2\\u20ac\\u2122ve given into my BPD impulses.\",\"created_utc\":\"1610507329\",\"over_18\":\"FALSE\",\"subreddit\":\"BPD\"},{\"title\":\"Breakdown Pending\",\"selftext\":\"[removed]\",\"created_utc\":\"1638601750\",\"over_18\":\"FALSE\",\"subreddit\":\"BPD\"},{\"title\":\"My best friend is constantly making me split on her\",\"selftext\":\"[deleted]\",\"created_utc\":\"1612201047\",\"over_18\":\"FALSE\",\"subreddit\":\"BPD\"},{\"title\":\"Relationships\",\"selftext\":\"I have recently started talking to a guy who I\\u00e2\\u20ac\\u2122ve always been close with. Its turned more flirty and just fun rather than friendship. I swore i never wanted a relationship again because with my BPD I just feel hard to love. Is it fair for me to date people? I dont know if i should end things or just see where they end up going. I feel lost with everything relationship related\",\"created_utc\":\"1643109427\",\"over_18\":\"FALSE\",\"subreddit\":\"BPD\"},{\"title\":\"DAE feel physically sore when they get triggered\\/are having a bad day?\",\"selftext\":\"My mother sent a very rude text to me when I asked her to stop ignoring me. This was the first time I had ever spoken up to her instead of suffering in silence. For the two days following I felt like someone held me down and kicked the shit out of me. When I woke up, I just stared at the wall and wished I hadn\\u00e2\\u20ac\\u2122t woken up. Those thoughts are familiar for me but ever since I\\u00e2\\u20ac\\u2122ve been medicated they\\u00e2\\u20ac\\u2122ve significantly lessened. But one single text from my mother triggered this 3 day long episode that I absolutely couldn\\u00e2\\u20ac\\u2122t control. I hate BPD, it makes me feel like I\\u00e2\\u20ac\\u2122ll never be a functional adult. I\\u00e2\\u20ac\\u2122m nearly 27 and can\\u00e2\\u20ac\\u2122t even leave the house some days. One seemingly small trigger sends me in to a downhill spiral that feels impossible to escape.\",\"created_utc\":\"1622260087\",\"over_18\":\"FALSE\",\"subreddit\":\"BPD\"},{\"title\":\"How do I feel emotions again\",\"selftext\":\"The only time I feel is when I\\u00e2\\u20ac\\u2122m with my kid. Other than that I feel like im just faking everything and now it\\u00e2\\u20ac\\u2122s getting to the point where I completely lose interest when people are conversing with me and I\\u00e2\\u20ac\\u2122ll check out into auto pilot or just walk away. I\\u00e2\\u20ac\\u2122ve tried explaining it to my wife but she just doesn\\u00e2\\u20ac\\u2122t understand how if I have no interest in a conversation i don\\u00e2\\u20ac\\u2122t really care to listen. Constantly feel my human connections slipping away to the point of I really don\\u00e2\\u20ac\\u2122t have friends anymore and the only thing keeping me grounded is my son.\",\"created_utc\":\"1638840428\",\"over_18\":\"FALSE\",\"subreddit\":\"BPD\"},{\"title\":\"Why do I always want to die?\",\"selftext\":\"I've spent the last few days at friends and everything is great, i didn't split or anything and everything is going well except i still constantly wanna die.\\nI just wanna give up but there's no reason why i might be feeling like this. It's so confusing and exhausting..\\nI don't wanna be like this. I just want to enjoy things.\\nMaybe it was just too much or sth? Idk..\",\"created_utc\":\"1634212860\",\"over_18\":\"FALSE\",\"subreddit\":\"BPD\"},{\"title\":\"I don't know if I'm ready to talk to my FP again...\",\"selftext\":\"[removed]\",\"created_utc\":\"1617123771\",\"over_18\":\"FALSE\",\"subreddit\":\"BPD\"},{\"title\":\"Handling unreciprocated love?\",\"selftext\":\"Hi guys, new in this subreddit and I really need advice with something. Like around a few months I've been hooking up with a lot of people, having one night stands and all. But before these one night stands I was a virgin for whole 22 years, I avoided sex bc of my traumas until now. And the minute I started having sex, I fell for the person I hooked up with first. It became a regular thing for us and I really want to have more with them but they're actually really uninterested in me as a person (they are emotionally distant) and it's like I get hurt and triggered by everything they do now. I become so upset I'm triggered 24\\/7 and I started self harm after stopping for like 2 years ago. It's affecting me too badly about alcohol and other substance addictions as well because I can't stand being sober and thinking about them.\\nAt first I really saw them as the person I needed the most, but now I can't help but getting so mad at them for every single thing they do. I don't talk about this out loud with them (sometimes I suck at hiding tho) but I internalize the whole anger instead and blame myself for being unloveable all the time. I feel like the best thing I can do is to stop seeing them altogether but it's also not something I can do because even though I'm mad I can't stay away from them or stop thinking about them. Any advice would be fine, I just want to get through this without losing my mind even more:(\",\"created_utc\":\"1654724808\",\"over_18\":\"TRUE\",\"subreddit\":\"BPD\"},{\"title\":\"Why can\\u00e2\\u20ac\\u2122t I be special to you\",\"selftext\":\"\\nI have a new FP in my online friend group. I try to spend most of my time with him on the same video games &amp; msging all day etc. We say Gm \\/ gn and it feels kind of like a relationship sometimes without the title. To him, we are FwB. We sext &amp; send nudes\\u00e2\\u20ac\\u00a6 normally I don\\u00e2\\u20ac\\u2122t like sending nudes because of how vulnerable it makes me feel. But whatever he wants right? He had a bad breakup back in April. His ex cheated on him with his ex best friend. He says he\\u00e2\\u20ac\\u2122s not ready for a relationship, and I\\u00e2\\u20ac\\u2122ve told myself I don\\u00e2\\u20ac\\u2122t want one\\u00e2\\u20ac\\u00a6 but to me what we do is special. He\\u00e2\\u20ac\\u2122s special to me. So why can\\u00e2\\u20ac\\u2122t I be special to him? He acts so close to me but then says to him it doesn\\u00e2\\u20ac\\u2122t matter if the flirting\\/sexting is with me or someone else. I occasionally feel used for my body and I don\\u00e2\\u20ac\\u2122t know what to do about it. He says \\u00e2\\u20ac\\u0153it hurts seeing you simp this hard for me and getting nothing in return\\u00e2\\u20ac\\u009d he says he feels like he\\u00e2\\u20ac\\u2122s hurting me. I feel like I\\u00e2\\u20ac\\u2122m hurting myself. He told me at the start he didn\\u00e2\\u20ac\\u2122t want a relationship. He says all these things but to me his actions say otherwise. He tells me he\\u00e2\\u20ac\\u2122d want to hold me in his arms the first night we\\u00e2\\u20ac\\u2122re together\\u00e2\\u20ac\\u00a6 though he says he only acts that way and says that stuff because he knows I like it. He says after he gets a dopamine high from talking \\/ sexting he feels even more depressed than he did before. This all came out last night when he was telling me I get too paranoid about him leaving. I thought we were okay but he hasn\\u00e2\\u20ac\\u2122t texted me gm yet. I feel lost and scared. I don\\u00e2\\u20ac\\u2122t know what to do\",\"created_utc\":\"1662562954\",\"over_18\":\"FALSE\",\"subreddit\":\"BPD\"},{\"title\":\"I want to marry this person yet i cant because its not what they want\",\"selftext\":\"I love this person so much.\\n\\nI have loved others in the past (been engaged and thought they were the one) and even been obsessed with them due to this illness .\\n\\nYet with this person, he listens to me, he calms me down, he makes me feel safe. He makes me feel loved and most importantly calm\\n\\nRecently i have been thinking about the prospect of marriage. \\n\\nLike i said i have been engaged before but it was for all the wrong reasons and i never expected or wanted it at the time. \\n\\nI keep thinking of us together and it feels like life has stalled.\\n\\nBut... I know he doesnt want marriage, hes already been married and it failed misribly. With a horrible divorce, they have a beautiful, intelligent daughter together. \\n\\nSo i completely understand why the idea is daunting. But yet i cant shake not feeling good enough.\\n\\nWe have discussed very briefly in the past (extremely briefly, hes not good with expressing emotions) that he is not sure he can give me marriage. \\n\\n Ive always wanted marriage.. And i keep seeing my friends and family getting married. And im so frigging happy for them! But then it comes down to thought of me and X will never have that, and then i get really depressed and think about my worth in life. \\n\\nI know i shouldnt think this way because i can genuinly see his view on it, but it feels as though im not good enough to even be considered for it. \\n\\n\\n\\n\\nAdvice needed please!\",\"created_utc\":\"1618624247\",\"over_18\":\"FALSE\",\"subreddit\":\"BPD\"},{\"title\":\"not sure what to do\",\"selftext\":\"hey! i don\\u00e2\\u20ac\\u2122t normally make posts or anything but i\\u00e2\\u20ac\\u2122m really worried and i\\u00e2\\u20ac\\u2122m not sure where else to find help\\u00e2\\u20ac\\u00a6 i have this internet friend that i\\u00e2\\u20ac\\u2122ve gotten really close to in the past year, and we like each other romantically but haven\\u00e2\\u20ac\\u2122t set a label to it. a few months ago she told me that she has bpd and since then it\\u00e2\\u20ac\\u2122s helped me understand her a bit better\\u00e2\\u20ac\\u00a6 i\\u00e2\\u20ac\\u2122ve been trying to research a lot so it can help in case things go back but it looks like i still have a bit of trouble. things have been a little more bumpy than usual since the year started\\u00e2\\u20ac\\u00a6 last night was perfectly fine, it was really good actually, and this morning too. but one thing led to another and she suddenly told me that she thinks we need a break. \\n\\ni\\u00e2\\u20ac\\u2122m not sure\\u00e2\\u20ac\\u00a6 i asked her if this was just a bad day and she told me that wasn\\u00e2\\u20ac\\u2122t the case. i have no idea what to do because\\u00e2\\u20ac\\u00a6 did she really want me to go? did she want to push and keep me away? and i don\\u00e2\\u20ac\\u2122t know whether i should actually stay away or push back. i\\u00e2\\u20ac\\u2122m worried that i\\u00e2\\u20ac\\u2122ll mess up even more. i know that i want to stick with her for as long as i can.\\n\\ni really love her a lot so this is really tough but i know that she must be feeling a lot worse than i am\\u00e2\\u20ac\\u00a6 she\\u00e2\\u20ac\\u2122s really strong and i care for her so much. i\\u00e2\\u20ac\\u2122m kind of heartbroken. i keep thinking\\u00e2\\u20ac\\u00a6 maybe she does mean what she says about me. i always try to be patient with her so i haven\\u00e2\\u20ac\\u2122t snapped before\\u00e2\\u20ac\\u00a6 she normally reaches out to me again eventually whenever she gets a bit mad at me? is this the same case? because it seems more serious than usual. after she told me she wanted a break i told her that i\\u00e2\\u20ac\\u2122ll always be here.\\n\\ni\\u00e2\\u20ac\\u2122d appreciate it if anyone replied with advice or their perspective of things\\u00e2\\u20ac\\u00a6 or anything that can help me understand better. i thought maybe she\\u00e2\\u20ac\\u2122s having a splitting episode but i don\\u00e2\\u20ac\\u2122t want to assume anything wrong\\u00e2\\u20ac\\u00a6 i\\u00e2\\u20ac\\u2122m pretty worried so i hope things can be solved. i want to do my best for her. thank you!\",\"created_utc\":\"1642325082\",\"over_18\":\"FALSE\",\"subreddit\":\"BPD\"},{\"title\":\"i actually hate myself\",\"selftext\":\"it doesn\\u00e2\\u20ac\\u2122t occur to me on a daily basis but i do hate myself. i have days where i\\u00e2\\u20ac\\u2122m content with how i look or think i might even look good, but i will always be self conscious. and when i\\u00e2\\u20ac\\u2122m not it comes down later. but i have no love myself. i wish i did. i am trying. but i do not believe i deserve good things. i have hurt so many. i am a damaged kid\\/person but i just have hurt so much and i do not believe i deserve good. i hope to just get to a point where i am only full of good give good, but where what i get back does not matter. i try to like myself and sometimes i do but god, maybe this is just a personality disorder. i am so lost. all i know is i am sad, trying to be better, trying to heal, trying to get stronger, i am trying. i just want to be okay.\",\"created_utc\":\"1656897560\",\"over_18\":\"FALSE\",\"subreddit\":\"BPD\"},{\"title\":\"Lost Sense of Self\",\"selftext\":\"Last week I was diagnosed with BPD. This diagnosis has turned my life upside down because I had no idea that the way I operate is abnormal. I was previously diagnosed with anxiety and depression, so I knew I had mental health problems, but I had no idea that almost everything about me was not normal. Others could see the problem but I couldn\\u00e2\\u20ac\\u2122t. I still don\\u00e2\\u20ac\\u2122t fully. \\n\\nWhile it feels good to understand why I feel the way I feel, the more I learn about BPD, the more uneasy I feel. I feel like almost every single aspect of who I am is a reflection of my BPD. \\n\\nFor example, I love to shop. I always joke that its my only hobby, but I tend to spend excessively. I have no savings. I often live paycheck to paycheck because I spend most of what I have. I have a favorite stuffed animal that I\\u00e2\\u20ac\\u2122ve had since I was 5 (I\\u00e2\\u20ac\\u2122m 27 now) that I sleep with every night. She is my most prized possession and I would give up everything, even my cats who I love dearly, before I would give her up. I am so attached to this thing that I don\\u00e2\\u20ac\\u2122t know what I\\u00e2\\u20ac\\u2122d do if I lost her, she got destroyed, etc. \\n\\nThese are just two examples, but I feel like it\\u00e2\\u20ac\\u2122s like this with every part of me. I hate that the things that brought me joy and comfort are symptoms of my illness. \\n\\nI know logically that it\\u00e2\\u20ac\\u2122s not true, but I feel like I am all BPD. I feel like there is nothing about me that isn\\u00e2\\u20ac\\u2122t a manifestation of BPD. I don\\u00e2\\u20ac\\u2122t know who I am anymore, if this version of me is the real, the inherent me, or if I would be someone completely different if I didn\\u00e2\\u20ac\\u2122t have BPD.\",\"created_utc\":\"1655603817\",\"over_18\":\"FALSE\",\"subreddit\":\"BPD\"},{\"title\":\"i\\u00e2\\u20ac\\u2122m in love with my groomer, what to do?\",\"selftext\":\"i first posted on the subreddit teenamiugly before it got taken down. some backstory, i was raped by my dad when i was younger and then had lots of mental issues, especially attachment issues. so i posted on that subreddit and got lots of attention from older guys. \\n\\none person messaged me saying he was 17 and sent a photo of \\u00e2\\u20ac\\u0153himself\\u00e2\\u20ac\\u009d. we called that day and hit it off instantly. he was funny and charming and we vibed so well, i dont think ive ever been that instantly comfortable with anyone before. at the end of the call he asked if i wanted to listen to him jerk off. i said no and he moved on, nothing else. \\n\\nnext day we called again and this time i offered to listen to him. two weeks went on like this and i showed him my naked body and my face while masturbating. two weeks after talking, he revealed that he was actually 25. he said he stumbled on the subreddit and thought i was super cute and wanted me to like him so i thoguht that was adorable. no one had ever wanted me to like them before. \\n\\nwe kept talking and during one of mastubating sessions (ew) he asked for \\u00e2\\u20ac\\u0153blackmail play\\u00e2\\u20ac\\u009d where he wanted a naked photo of me with my full name, face and address. being naive i sent it and he still has it to this day. \\n\\nwe\\u00e2\\u20ac\\u2122ve been talking for around a year now and i know the city he lives in and how he looks. we are planning on meeting up soon. i know i\\u00e2\\u20ac\\u2122m being abused but i don\\u00e2\\u20ac\\u2122t feel like it. we\\u00e2\\u20ac\\u2122re dating and i do think i\\u00e2\\u20ac\\u2122m in love, and i think he may be falling for me. i\\u00e2\\u20ac\\u2122m not scared of reporting him, i obviously wouldn\\u00e2\\u20ac\\u2122t tell anyone because i don\\u00e2\\u20ac\\u2122t want to get him in trouble. \\n\\nhe\\u00e2\\u20ac\\u2122s never been harsh or emotionally abusive. he has always been supportive of me and is genuinely the perfect boyfriend i could ask for. i can 100% see spending the rest of my life with him. i know everyone is going to say to leave him but i\\u00e2\\u20ac\\u2122ve tried multiple times, we just keep coming back to each other. he has tried leaving for my sake but we just come back together somehow\",\"created_utc\":\"1630334598\",\"over_18\":\"TRUE\",\"subreddit\":\"BPD\"},{\"title\":\"In the market for a FP\",\"selftext\":\"Okay not like my FP isn\\u00e2\\u20ac\\u2122t in my life anymore. (Btw I\\u00e2\\u20ac\\u2122m 24yr F with BPD) \\nThey just became my romantic partner and like we\\u00e2\\u20ac\\u2122ve been goin for a bit. And we\\u00e2\\u20ac\\u2122re having a baby and we just moved and we worked together and I\\u00e2\\u20ac\\u2122m with them always and I love them\\u00e2\\u20ac\\u00a6.but like I need someone new to be obsessed over. I need someone new to give me all the attention. But my partner is still mine and we stuck together fo lyfe.  He gets the concept and is chill with me looking for friends. I just really want a platonic friend and it\\u00e2\\u20ac\\u2122s weirdly harder to find than I thought it\\u00e2\\u20ac\\u2122d be.  Just thought I\\u00e2\\u20ac\\u2122d share since it\\u00e2\\u20ac\\u2122s been on my mind. It\\u00e2\\u20ac\\u2122s weird. It\\u00e2\\u20ac\\u2122s like a need that must be met and if it\\u00e2\\u20ac\\u2122s not I have this idle anxious energy in me over it all.\",\"created_utc\":\"1642028915\",\"over_18\":\"FALSE\",\"subreddit\":\"BPD\"},{\"title\":\"Splitting and getting back together...the aftermath\",\"selftext\":\"Sooo I kind of need advice. \\nI was overwhelmed with my life and so much felt wrong, I split on my bf, broke up with him, withdrew from everyone, and isolated myself in my apartment for a month painting my bf black and calling family to tell them horror stories (which conveniently leave out the facts of my BPD and my own abusive behavior) about him being abusive and the worst person ever. To keep myself \\\"on track\\\" with hating him. \\n\\nThere came a day when I was ready to stop hating him, we are back together and working on dealing with things better. However, now my family who has never met him has nothing to do except believe the things I said when splitting. They dorm know my diagnosis and I am afraid to share. I'm afraid to talk about us being back together. What have I done? I want them to love him and know he has been an overall wonderful thing for me... But they never got to hear about the good things bc I only talk about personal life when I have a delusion to enforce on myself... Used other people and their natural reactions to awful accusations as fuel for my split...\\nHow can I even explain? They now think I am a victim and being manipulated to believe I'm not....\\n\\nMy partner has a hard time understanding too. Sometimes he will still be hurt that I did that. He doesn't talk shit on me and he has all kinds of horror stories. He just doesn't want others to not want the best for us. Neither do I, most of the time...so hard to explain to him too that its a coping mechanism and not bc I think he deserves to be hated\",\"created_utc\":\"1629496667\",\"over_18\":\"FALSE\",\"subreddit\":\"BPD\"},{\"title\":\"You\\u00e2\\u20ac\\u2122re all wonderful valid, beautiful people!\",\"selftext\":\"Hey guys just want to let you know you\\u00e2\\u20ac\\u2122re all amazing and you\\u00e2\\u20ac\\u2122re going to get through this! There\\u00e2\\u20ac\\u2122s always hope and you\\u00e2\\u20ac\\u2122re not defined by your disorder. I hope this isn\\u00e2\\u20ac\\u2122t against the rules or this is weird but I\\u00e2\\u20ac\\u2122ve seen a horrendous upsurge in people internet armchair diagnosing Amber Hurd with BPD and honestly I think it\\u00e2\\u20ac\\u2122s disgusting. You are valid, and you have support \\u00f0\\u0178\\u2019\\u0153\",\"created_utc\":\"1650648591\",\"over_18\":\"FALSE\",\"subreddit\":\"BPD\"},{\"title\":\"Should I confront\\/talk to people with my negative thoughts about them?\",\"selftext\":\"Just typing that is cringe but honest I don\\u00e2\\u20ac\\u2122t know how else to say it. Constantly paranoid but thinking about ways to fix it so I\\u00e2\\u20ac\\u2122m thinking maybe just flat out asking for the truth? \\n\\nIf I\\u00e2\\u20ac\\u2122m sh*tty say it I want to be better\",\"created_utc\":\"1627622374\",\"over_18\":\"FALSE\",\"subreddit\":\"BPD\"},{\"title\":\"Could it be a trauma bond if a guy [35M] goes back to an ex [33F] when He was disgusted by her, and stopped having sex w\\/or kissing her? He also said he...\",\"selftext\":\"*Wasnt in love with her\\n\\n*Wanted to punish her for the things she\\u00e2\\u20ac\\u2122s done\\n\\n*Kicked her out of their apt and informed the landlord of the situation to get her off the lease\\n\\n*Said she \\u00e2\\u20ac\\u0153stole\\u00e2\\u20ac\\u009d his fb friends and acted like they were his\\n\\n*Thought she was a narcissist, learned all about the condition and narcissistic abuse. He even blogged about it and his difficulty recovering from it. \\n\\n*Vented about her daily \\n\\n\\nHe said She:\\n\\n*Was a liar\\n\\n*May\\u00e2\\u20ac\\u2122ve killed one of her patients and fraudulently claimed the death benefits (he showed me the obit and said he reported her to the dept of veterans affairs and the state bureau of investigation \\n\\n*May\\u00e2\\u20ac\\u2122ve been involved in the deaths of 2 others\\n\\n*May\\u00e2\\u20ac\\u2122ve tried to poison him &amp;amp;amp;amp; her own children \\n\\n*Was a drug addict\\n\\n*Didn\\u00e2\\u20ac\\u2122t shower or wipe well so she smelled like literal sht\\n\\n*Was manipulative, possibly a narcissist &amp;amp;amp;amp; \\u00e2\\u20ac\\u0153fucked up\\u00e2\\u20ac\\u009d\\n\\n*Abused him emotionally to the point he stress ate, drank &amp;amp;amp;amp; \\u00e2\\u20ac\\u0153lost\\u00e2\\u20ac\\u009d himself\\n\\n...but they got back together\\n\\nTLDR: What could make a guy go back to an ex after he says she manipulated and emotionally abused him, potentially killed multiple people, and tried to poison him? Is that like an addiction?\",\"created_utc\":\"1606843799\",\"over_18\":\"FALSE\",\"subreddit\":\"BPD\"},{\"title\":\"Does anyone know about any BPD support or peer groups, specifically located in Melbourne, Australia? If not, any group that meets in Australia that offers online meetings?\",\"selftext\":\"I was recently diagnosed but I\\u00e2\\u20ac\\u2122m not sure i identify with it. I would love to join a group and be able to hear other people\\u00e2\\u20ac\\u2122s stories and hopefully better understand my own behaviour.\",\"created_utc\":\"1631398847\",\"over_18\":\"FALSE\",\"subreddit\":\"BPD\"},{\"title\":\"Should I go back to my old therapist?\",\"selftext\":\"My last therapist, who I saw for over 4 years, left to go to another practice a few months ago. After that I started to see a new therapist and then was diagnosed with BPD. My current therapist doesn't do DBT, is always at least 10 minutes late every time and I don't really like them honestly. A mobile team from the local crisis center came out to visit me to talk about a few things and after I told them about my last and current therapist and they basically told me, \\\"please call your old therapist and see her again\\\". \\n\\nI know my psychiatrist would be totally fine with me going back to my old therapist, as she has told me before. My old therapist does virtual appointments, takes my insurance and is accepting new clients (and does DBT on top of all that). Should I go back to my old therapist? I'm really, really leaning towards yes.\",\"created_utc\":\"1652053052\",\"over_18\":\"FALSE\",\"subreddit\":\"BPD\"},{\"title\":\"Scared of Relationships\",\"selftext\":\"So this is a bit of a story time. \\n\\nI ended up dating a guy last year and I thought I really loved them, at the time they were also my FP and I think I ended up being love bombed. I clinged to them for the validation and at points I felt safe with them but I was super scared to lose them. We ended up fighting a lot all the time and they would constantly threaten to leave and walk away. It hurt a lot every time they would threaten it and even if I didn't do anything wrong I always found myself apologising all the time. \\n\\nI even stayed with them even though they cheated on me. They promised never to do it again and I put up with their behaviour for a long time. Only in January when I found out again they had been hooking up behind my back did I end it with them. It was super hard and I found myself going back to them because they were still my FP. I had to break myself away from them which was so, so hard to do. But I managed. It's been 10 months since then.\\n\\nNow I don't know if I want another realtionship because I feel like I get too attached too quickly and I don't know if I can handle that again. Often I question if I was the bad person. I must have done something wrong for them to cheat on me. I'm scared I'm going to end up in the same position dating someone else.\",\"created_utc\":\"1634830318\",\"over_18\":\"FALSE\",\"subreddit\":\"BPD\"},{\"title\":\"how to get rid of an FP?\",\"selftext\":\"[removed]\",\"created_utc\":\"1642240112\",\"over_18\":\"FALSE\",\"subreddit\":\"BPD\"},{\"title\":\"Any are of you Bisexual (or sexually fluid), and do you ever feel like your sexuality changes with your mood and emotional episodes?\",\"selftext\":\"I'm attracted to females, males, and most things in between, and I feel like I desire one gender more than others sometimes when I have episodes or my mood is fluctuating. \\n  \\nDoes anyone who isn't straight feel this at times?\",\"created_utc\":\"1609312203\",\"over_18\":\"FALSE\",\"subreddit\":\"BPD\"},{\"title\":\"Does anyone else go absolutely feral when people close to you suddenly give you the cold shoulder?\",\"selftext\":\"It makes me fucking \\u00f0\\u009d\\u02dc\\u00bd\\u00f0\\u009d\\u2122\\u0160\\u00f0\\u009d\\u2122\\u2030\\u00f0\\u009d\\u2122\\u2020\\u00f0\\u009d\\u2122\\u20ac\\u00f0\\u009d\\u2122\\u008d\\u00f0\\u009d\\u2122\\u017d\\n\\nMy angry, petty bitch mode activates and I shut down 100% when they question my sudden change in behavior \\n\\nThis is probably the worst thing about my symptom of BPD that\\u00e2\\u20ac\\u2122s really hard to change\",\"created_utc\":\"1634066023\",\"over_18\":\"FALSE\",\"subreddit\":\"BPD\"},{\"title\":\"*repost d\\/t my bf finding my other acc* struggling to find who I am.\",\"selftext\":\"[removed]\",\"created_utc\":\"1643999293\",\"over_18\":\"FALSE\",\"subreddit\":\"BPD\"},{\"title\":\"I have BPD, should I break-up with my s.o.?\",\"selftext\":\"My boyfriend is my \\\"favourite person\\\", my love for him is maniacal, it's more like an obsession. I'm extremely jealous, to the point I often end up self-harming when he talks with other people. I don't want him to have any other friends beside me. The thing is: he does have other friends beside me and he casually wants to meet with them, as it should be. But I get so crazy and evil when he aks me if he can go out with them...and he suffers a lot, obviously. I tried so hard to change my behaviour but I just can't help it. I only want him for myself. I'd lock him up in a room forever where only I can see him if I could. I'm not in the position to seek help right now. I don't want to suffer so much anymore and I don't want him to suffer either. Should I break up with him for our own good?\",\"created_utc\":\"1611597039\",\"over_18\":\"FALSE\",\"subreddit\":\"BPD\"},{\"title\":\"The only person I ever saw a future with left me\",\"selftext\":\"CW: Suicide\\n\\nHi, this is my first ever post on here. It\\u00e2\\u20ac\\u2122s more a vent than a need for a perspective but that would help a lot too.\\n\\nIn 2019, I met a guy on tinder when I was visiting another country. Long story short, after complicated decisions, we finally was in a relationship after a year of being friends. We were together for more than a year. At the beginning, everything was amazing even though we were doing long-distance. I have met him and stayed over at his place countless times when we were still friends so we pretty much knew each other very well. He was my soulmate and even became my FP a little after meeting. Somewhere in the middle of our relationship, my symptoms were just appearing stronger and stronger and by that I mean thinking he is going to leave me, being super upset over minor things that would trigger me, crying to bed at night because of how lonely I felt even though we just FaceTimed and we were normally talking etc. Basically all the good stuff that comes with having BPD lol. \\n\\nFast forward to about 2 weeks ago, I wrote my final letter (I would sometimes get emotions so intense that I\\u00e2\\u20ac\\u2122d impulsively write letters on google doc to send him and it\\u00e2\\u20ac\\u2122s mostly the same issues and how I was feeling about us) and that just did it for him I guess. He called me that night and cried, telling me how he couldn\\u00e2\\u20ac\\u2122t do this anymore and that we\\u00e2\\u20ac\\u2122re breaking up. He said different reasons as to why and it\\u00e2\\u20ac\\u2122s mostly related to healing ourselves separately. He\\u00e2\\u20ac\\u2122d say, \\u00e2\\u20ac\\u0153focus on yourself.\\u00e2\\u20ac\\u009d Needless to say, I fell into a deep one-week depressive state where after genuinely wanting to off myself. We are still friends now but I still constantly ponder about why he wanted to break up with my so suddenly. He also said that he was getting exhausted from trying to take care of someone(me) who doesn\\u00e2\\u20ac\\u2122t seem to want to help themselves (me). He has his own issues as well being a newly out-of-the-closet trans guy and I also used to try to make him feel comfortable about himself and generally happy. I still worry about him about it and that\\u00e2\\u20ac\\u2122s one thing that makes sense why he also said he wanted me-time after we broke up. He even said he\\u00e2\\u20ac\\u2122s thought about it for a while which crushed me even more. Anyway, now whenever I think of the reason why he would want to break up, this is my thought(s). \\u00e2\\u20ac\\u0153If he is okay with being alone now barely texting me, does that mean that when he used to call me a lot was all just fake?\\u00e2\\u20ac\\u009d \\u00e2\\u20ac\\u0153Did he want to break up with me so badly just because he wanted to be alone?\\u00e2\\u20ac\\u009d \\u00e2\\u20ac\\u0153Was I just being used for his entertainment?\\u00e2\\u20ac\\u009d \\u00e2\\u20ac\\u0153Why does he want to get so far away from me right after we broke up? Is it because he is disgusted with me and hates me?\\u00e2\\u20ac\\u009d\\n\\nAfter being with him and listening to all his promises about how he was never going to leave and him even talking about marriage once early on and always talking about how we are going to decorate our place in the future which is all what I truly believed and trusted him for saying, I PHYSICALLY cannot trust anyone for their words anymore and that makes the world for me look very hopeless. I feel even more broken than before, though I have started therapy again and am actively trying to think positively about myself now, but this situation is still so fresh to me and I constantly think about it everyday. I mean imagine having a \\u00e2\\u20ac\\u0153happy\\u00e2\\u20ac\\u009d relationship and suddenly being broken up with so brutally and also being pushed away by the person who used to want to call you multiple times a day. It\\u00e2\\u20ac\\u2122s so hard for me to wrap my head around. Is it just me? \\n\\nThat\\u00e2\\u20ac\\u2122s my story. I\\u00e2\\u20ac\\u2122m still trying to get through it everyday and I\\u00e2\\u20ac\\u2122m actively finally trying to seek for and actually work on getting the treatment that I\\u00e2\\u20ac\\u2122ve been needing for the longest time. Thanks for reading.\",\"created_utc\":\"1626182244\",\"over_18\":\"FALSE\",\"subreddit\":\"BPD\"},{\"title\":\"Splitting on my girlfriend 2 weeks into the relationship\",\"selftext\":\"Now 3 weeks later it feels stronger than ever and I don\\u00e2\\u20ac\\u2122t know what to do. I want to break up but I think that I like her still, deep down, and I don\\u00e2\\u20ac\\u2122t wanna hurt her. And I don\\u00e2\\u20ac\\u2122t trust myself enough to do it too, I only realized yesterday that it made no sense for me to almost \\u00e2\\u20ac\\u0153hate\\u00e2\\u20ac\\u009d her. But everything she does annoys me. I feel trapped. I\\u00e2\\u20ac\\u2122m constantly doubting the validity of my feelings because she\\u00e2\\u20ac\\u2122s also mentally ill and hasn\\u00e2\\u20ac\\u2122t been to therapy at all, so often I end up feeling like I have to take on a role of caregiver against my will.  \\nI \\u00e2\\u20ac\\u0153recently\\u00e2\\u20ac\\u009d got out of an abusive relationship and it took me a long time to heal, which is why when I started dating again I was very clear about how important communication and boundaries are for me. Sometimes I feel like she manipulates me with little things to test the limits of my boundaries. When I don\\u00e2\\u20ac\\u2122t magically predict her thoughts she distances herself and gives me the silent treatment for a while, and after she realizes I\\u00e2\\u20ac\\u2122m not crawling after her, she pouts and starts talking again. I hate this so much and it\\u00e2\\u20ac\\u2122s what started the splitting. I have tried to talk to her about these things and she just apologizes and promises to do better but there\\u00e2\\u20ac\\u2122s no change. At this point I just feel like I\\u00e2\\u20ac\\u2122m avoiding her: I work the night shift, she works part time so I keep using my job to not see her.\",\"created_utc\":\"1639131600\",\"over_18\":\"FALSE\",\"subreddit\":\"BPD\"},{\"title\":\"Wanted to introduce myself\",\"selftext\":\"Hi everyone. I\\u00e2\\u20ac\\u2122m a 23F and I got diagnosed with BPD a little under two months ago. I see a psychotherapist who does DBT work with me. I\\u00e2\\u20ac\\u2122ve had a very.. difficult life. It just occurred to me that there might be a community for me to join, glad I was right. I\\u00e2\\u20ac\\u2122m really hoping to get to know some people. I have a bad issue with oversharing and constantly trying to talk my way out of my head. My dms are open to whoever wants to share a stream of consciousness with me, or if any other people my age would like to talk. I\\u00e2\\u20ac\\u2122m being thrown around by my meds a bit, but I\\u00e2\\u20ac\\u2122m starting to see some improvements. On top of BPD, I\\u00e2\\u20ac\\u2122m also doing DBT to address PTSD and OCD. I don\\u00e2\\u20ac\\u2122t know where I\\u00e2\\u20ac\\u2122m going with any of this other than to say you might see me on here a lot. :-)\",\"created_utc\":\"1613000822\",\"over_18\":\"FALSE\",\"subreddit\":\"BPD\"},{\"title\":\"What to say about Dr appts?\",\"selftext\":\"I meet a counselor weekly and psychiatrist monthly.  A potential partner asked me why I have so many dr appts.  \\n\\nI don't want to lie and be manipulative, but I'm not ready to talk issues yet.\",\"created_utc\":\"1631504734\",\"over_18\":\"FALSE\",\"subreddit\":\"BPD\"},{\"title\":\"What are your most prominent BPD symptoms? I\\u00e2\\u20ac\\u2122m curious bc I know everyone\\u00e2\\u20ac\\u2122s different\",\"selftext\":\"[removed]\",\"created_utc\":\"1666288148\",\"over_18\":\"TRUE\",\"subreddit\":\"BPD\"},{\"title\":\"is he doing it to hurt me?\",\"selftext\":\"so i\\u00e2\\u20ac\\u2122ve been exclusively dating a guy with bpd. everything was going great but these two last weeks, we\\u00e2\\u20ac\\u2122ve been arguing a lot. It all started because i caught him in a lie and i overreacted. he told he was gonna hang out with some friends but he was actually hanging out with a girl friend. When i confronted him, he told me he lied because he knew i was gonna overreact. I then explained to him that lying made it worse because now i don\\u00e2\\u20ac\\u2122t trust him like i used to and that bothers him. I\\u00e2\\u20ac\\u2122ve been away for like 4 days at the appartement and i when i came back, i noticed my stuff moved and most of it was hidden as if he was trying to hide the fact that he has a gf. I confronted him and he told me to no worry, he just decided to clean the appartement bc i leave my stuff everywhere but like idk\\u00e2\\u20ac\\u00a6.. I told him to just tell me if he wanted to see other people and not to be with me. It\\u00e2\\u20ac\\u2122ll hurt more if he cheats on me than if we just break up. He told me that he loves me and that he would never do that. That i just need to trust him. I really want to because i love him but i don\\u00e2\\u20ac\\u2122t wanna be manipulated or gaslighted. My question is: Do people with BPD tend to cheat on their partners for attention or gaslight them? If yes, do they do it on purpose?\",\"created_utc\":\"1640919772\",\"over_18\":\"FALSE\",\"subreddit\":\"BPD\"},{\"title\":\"Did I block out CSA or did it never happen\",\"selftext\":\"Over the past year I have gotten some insight on a subject I forgot about for a long time. I believe I was a victim of CSA when I was about 2-3 years old. I just don\\u00e2\\u20ac\\u2122t remember at all so part of me thinks I made it up. Even though all of the information makes it seem very likely that it happened. Do I just continue to live my life with no answers? There\\u00e2\\u20ac\\u2122s no one that can tell me what happened. Is there any way I can somehow get these memories to resurface? The not knowing makes me feel so much worse during an episode.\",\"created_utc\":\"1629597444\",\"over_18\":\"FALSE\",\"subreddit\":\"BPD\"},{\"title\":\"I Need Help\",\"selftext\":\"I don't know what to do anymore. This illness is eating me alive. I am afraid of what I will do to myself when I get into these depressive states. I feel so worthless half the time and then half the time I feel like I am amazing. I can't do this anymore. I feel as though no one cares for me. All anyone does is leave me. Maybe it is because of how horrible I am. If anyone has advice, please give me some. My boyfriend is the only reason I am alive. I want to learn to live for myself, but I don't know how to.\",\"created_utc\":\"1665616617\",\"over_18\":\"TRUE\",\"subreddit\":\"BPD\"},{\"title\":\"I feel \\u00e2\\u20ac\\u0153expired\\u00e2\\u20ac\\u009d\",\"selftext\":\"I wondered whether many, or any of you, have been where I am at now. \\nBesides BPD I also suffer from CPTSD. I\\u00e2\\u20ac\\u2122m 30, male, gay, and I was raised by a sociopath (father) and covert NPD (mother). \\nAbout 2 months ago I went to work and the day really started like any other day. But oh did it quickly turn 180. Half way through my shift I let my manager know i was starting to feel unwell and needed to go home. It was probably taken as a physical illness, which I did not mean. One way or the other I got my way and went home. There, I decided that that was the day when im gonna empty the three bottles of wine I had at home along with an entire month worth of sleeping pills and sedatives. Upon taking it all i thought to myself that it would be a pity to die without addressing my trauma and the reasons why ive been having suicide attempts every so often ever since i turned 6. Long story short I called my mother (the only parent i had contact with, i haven\\u00e2\\u20ac\\u2122t spoken to my father in about 10-12 years). That did not go well. Anyway, my finace finished work too early that day and found me too soon. He called the ambulance, i was taken in to the a&amp;e. My stomach was pumped and off they sent me home the next day. I havent really spoken to her since. I did let my mother know i was alive after all and that im not done trying to eventually become successful at killing myself. \\n\\nCircling back to the topic- ever since then i feel expired. I cant find a place for myself in this world, whether its home or work. I was supposed to die that day. Nothing makes sense anymore. Everything feels like an effort so bad id rather strangle myself. \\n\\nPeople would talk to me- i snap. Why are they even making a sound? \\n\\nI have to do my groceries- the fuck is this i asked to no longer need groceries. \\n\\nI go out- why are the people fucking there why is it so fucking warm and why is my body sweating. \\n\\nAll those things just suddenly feel so unbearable, complete deal breakers, for when it comes to my relationship with life. \\n\\nI feel expired because i was supposed to die. Now I\\u00e2\\u20ac\\u2122m experiencing weird snappy shit cuz i was not supposed to be here today to live through all those things AGAIN. \\n\\nHave u ever felt like this after your most successful suicide attempt? \\n\\nWill this ever end??? Im sick of being annoyed at everything every single day. EVERY FUCKING THING TICKS ME OFF\",\"created_utc\":\"1623087605\",\"over_18\":\"FALSE\",\"subreddit\":\"BPD\"},{\"title\":\"Someone help me work through all this? If not I really just need to vent for a minute.\",\"selftext\":\"*Earlier this week:*\\n\\n*Me: asks husband what he\\u00e2\\u20ac\\u2122s up to*\\n\\n*Husband: ignores me for a second too long and then gives a vague short somewhat annoyed sounding answer without even looking in my direction because his eyes are glued to his phone*\\n\\n*My brain: your very existence irritates him and you should just kill yourself. Also he\\u00e2\\u20ac\\u2122s probably hiding things from you again, and you just caught him again- but you don\\u00e2\\u20ac\\u2122t have to deal with it if you just die tho \\u00f0\\u0178\\u00a4\\u201d*\\n\\n*Explanation\\/ Reality: husband was actually just checking the tracking info on a surprise present for me when I walked up- it\\u00e2\\u20ac\\u2122ll be here Thursday instead of today, so he was irritated.*\\n\\n*Still kinda want to kill myself\\u00e2\\u20ac\\u00a6but now I really wanna know what the surprise is \\u00f0\\u0178\\u02dc\\u2018*\\n\\n**Update: The surprise was an Xbox series X\\u00e2\\u20ac\\u00a6 it\\u00e2\\u20ac\\u2122s officially his- because the power supply on his Xbox One just broke (and he didn\\u00e2\\u20ac\\u2122t want to spend $20 on a new one\\u00e2\\u20ac\\u00a6but decided to spend $900ish for this bundle since it was the only way to find a series X in stock)\\u00e2\\u20ac\\u00a6but I can play it too until they\\u00e2\\u20ac\\u2122re back in stock and I can get my own- just not in the expensive bundle because that\\u00e2\\u20ac\\u2122d be unnecessary and ridiculously expensive\\u00e2\\u20ac\\u00a6**\\n\\nI don\\u00e2\\u20ac\\u2122t really know how to react\\u00e2\\u20ac\\u00a6he\\u00e2\\u20ac\\u2122s very excited, and I think he is starting to pick up on me not totally sharing his level of excitement\\u00e2\\u20ac\\u00a6 all I\\u00e2\\u20ac\\u2122ve managed to say is that I\\u00e2\\u20ac\\u2122m in shock. Which I am- just not for the reasons he\\u00e2\\u20ac\\u2122s probably thinking.\\n\\n**Why am I really in shock?**\\n\\n**1. We\\u00e2\\u20ac\\u2122ve been looking for the new Xbox everywhere, just like a lot of other people- but recently had decided\\/agreed even if we could find them that we weren\\u00e2\\u20ac\\u2122t going to splurge on them\\u00e2\\u20ac\\u00a6especially since we would need to get one for each of us bc it wouldn\\u00e2\\u20ac\\u2122t be fair for just one of us to get  it.**\\n\\n**2. There are other more practical priorities that we have been saving money for, that he\\u00e2\\u20ac\\u2122s been dragging his feet on for months now.**\\n\\n**3. My little brothers birthday just passed recently and it was a big milestone\\u00e2\\u20ac\\u00a6I had to fight my husband on how much our budget could be for a present.**\\n\\n**4. My mom\\u00e2\\u20ac\\u2122s birthday is also coming up which he moaned and groaned over bc of the prospect of having to get her something too.**\\n\\n**5. He specifically told me this was supposed to be a surprise for me\\u00e2\\u20ac\\u00a6totally unprompted, and I actually dared to be excited about it. But then said it was for both of us a day later. Now that its here its just his apparently, and we\\u00e2\\u20ac\\u2122re sharing temporarily.**\\n\\n**6. We have been spending a lot of money lately, which has been something we\\u00e2\\u20ac\\u2122ve had many conversations about recently\\u00e2\\u20ac\\u00a6whenever I want to talk about things like having to get new windows before winter\\u00e2\\u20ac\\u00a6**\\n\\n**7. I\\u00e2\\u20ac\\u2122m trying really hard not to take this personally, bc it really feels like this said a lot about what his priorities really are\\u00e2\\u20ac\\u00a6and I\\u00e2\\u20ac\\u2122m not actually one of them. I\\u00e2\\u20ac\\u2122m also having a hard time not splitting on him and seeing this as another one of his selfish, self absorbed, impulsive, shitty behaviors that we are constantly rehashing in marriage counseling.**\\n\\nIdk the whole thing feels petty- and its the least of my\\/our problems, but it\\u00e2\\u20ac\\u2122s just another thing to top the shit cake and I\\u00e2\\u20ac\\u2122m still really struggling not to spiral over the bigger picture of the situation. I don\\u00e2\\u20ac\\u2122t want to rain on his parade, but I\\u00e2\\u20ac\\u2122m honestly kinda getting upset the more I think about it all. I\\u00e2\\u20ac\\u2122m trying really hard to be happy for him but I\\u00e2\\u20ac\\u2122m stuck stewing. He wants to play, but I think I need to go for a walk.\",\"created_utc\":\"1633049225\",\"over_18\":\"FALSE\",\"subreddit\":\"BPD\"}]"